# Pandas Import

In [1]:
import pandas as pd

# Dictionary to Series and DataFrame

In [3]:
#create a Dictionary to Series and DataFrame
data = {
    'name' : ['Alice', 'Bob', 'Charlie'],
    'age' : [25, 30, 35],
    'city' : ['New York', 'Los Angeles', 'Chicago']
}

In [4]:
data

{'name': ['Alice', 'Bob', 'Charlie'],
 'age': [25, 30, 35],
 'city': ['New York', 'Los Angeles', 'Chicago']}

In [5]:
name_series = pd.Series(data['name'])
name_series

0      Alice
1        Bob
2    Charlie
dtype: object

In [6]:
age_series = pd.Series(data['age'])
age_series

0    25
1    30
2    35
dtype: int64

In [7]:
city_series = pd.Series(data['city'])
city_series

0       New York
1    Los Angeles
2        Chicago
dtype: object

In [8]:
df = pd.DataFrame(data)
df

      name  age         city
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [11]:
city_series = df['city']
city_series

0       New York
1    Los Angeles
2        Chicago
Name: city, dtype: object